package utils;

import java.util.Random;

public class RandomN {

    public    String RandomNickname() {
        String[]  name = new String[]{"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩",
                "杨","朱","秦","尤","许","何","吕","施","张","孔","湛","汪","祁","毛","邵","禹","狄","米","贝","明",
                "曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚",
                "范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","成","戴",
                "唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常","乐","于","计",
                "傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","穆","萧","尹","姚","栅","谷","梁",
                "杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁",
                "钟","徐","丘","骆","高","夏","蔡","田","樊","胡","凌","霍","虞","万","支","柯","昝","管","卢","莫",
                "万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应","宗","丁","宣","贲","邓","郁",
                "单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀",
                "于","惠","甄","曲","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","诸",
                "焦","巴","弓","牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁",
                "仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景","詹","束","龙","叶","幸","司","韶","郜",
                "黎","蓟","薄","印","宿","白","怀","蒲","邰","从","索","咸","籍","赖","卓","蔺","屠","蒙","池","纪",
                "乔","阴","郁","胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉",
                "宰","郦","雍","却","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","浦","尚","农","温","别",
                "易","常","乐","于","计","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","穆","萧",
                "尹","姚","栅","谷","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜",
                "郭","梅","盛","林","刁","钟","徐","丘","骆","高","夏","蔡","田","樊","胡","凌","霍","虞","万","支",
                "柯","昝","管","卢","莫","经","房","裘","缪","干","顾","孟","平","黄","穆","萧","尹","姚","臧","庞",
                "时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","伏","谈","宋","茅","熊","舒",
                "樊","胡","凌","霍","虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应","宗",
                "黄埔","诸葛","司马","叶赫","慕容","欧阳","上官","公孙","夏侯","端木","南宫","尉迟","司寇","钟离","独孤"};
        String[]  nameto = new String[]{
                "轩","宇","浩","瑞","瑾","涵","萱","梓","欣","怡","辰","霖",
                "烁","婷","蕊","宸","灏","妍","恺","淼","杰","嗳","龘","单",
                "子涵", "思宇", "欣怡", "浩然", "瑾萱", "诗琪", "宇辰", "紫萱",
                "一鸣", "雨彤", "皓轩", "子轩", "宇辰", "紫萱", "俊杰","子轩",
                "俊杰", "晨曦", "梦洁","大新","八月","龙斗","邵兵",""
        };
        java.util.Random random = new java.util.Random();

        int name1 = random.nextInt(name.length);

        int name2 = random.nextInt(nameto.length);

        String nameone = name[name1];
        String nameto2 = nameto[name2];
        String gather = nameone + nameto2;
        return gather;
    }

    public String RandompersonalizedSigna(){
        String[]  personalizedsigna = new String[]{
                "笑对人生，每一天都是新的开始",
                "梦想不抛弃苦心追求的人",
                "心若向阳，无畏悲伤",
                "人生如戏，全靠演技",
                "不忘初心，方得始终",
                "逆风的方向，更适合飞翔",
                "静待花开，岁月静好",
                "人生若只如初见",
                "活在当下，珍惜眼前",
                "岁月静好，现世安稳",
                "人生没有彩排，每天都是现场直播",
                "世界那么大，我想去看看",
                "心有猛虎，细嗅蔷薇",
                "时光不老，我们不散",
                "人生得意须尽欢，莫使金樽空对月",
                "岁月是把杀猪刀，但也是一把雕刻刀",
                "生活不止眼前的苟且，还有诗和远方",
                "愿你出走半生，归来仍是少年",
                "人生就像一场马拉松，不在乎速度，只在乎坚持",
                "人生就像一场游戏，重要的不是结果，而是过程",
                "人生如茶，需要慢慢品味",
                "人生如棋，落子无悔",
                "人生如歌，需要用心去唱",
                "人生如诗，需要用心去品",
                "人生如酒，需要慢慢品味",
                "人生如花，需要用心去呵护",
                "人生如画，需要用心去描绘",
                "人生如书，需要用心去读",
                "人生如梦，需要用心去体验",
                "人生如逆旅，我亦是行人",
                "人生就像一场电影，每个人都是主角",
                "人生就像一场旅行，不在乎目的地，只在乎沿途的风景",
                "人生没有过不去的坎，只有转不过的弯",
                "人生就是一场修行，修心养性",
                "人生就是一场旅行，不在乎目的地，只在乎沿途的风景",
                "人生就像一场电影，每个人都是主角",
                "人生如逆旅，我亦是行人",
                "人生就像一场游戏，重要的不是结果，而是过程",
                "人生如茶，需要慢慢品味",
                "人生如歌，需要用心去唱",
                "人生如酒，需要慢慢品味",
                "人生如花，需要用心去呵护",
                "人生如画，需要用心去描绘",
                "人生如书，需要用心去读",
                "人生如梦，需要用心去体验",
                "人生如戏，需要用心去演绎",
                "人生如茶，需要慢慢品味",
                "人生如歌，需要用心去唱",
                "人生如酒，需要慢慢品味",
                "人生如花，需要用心去呵护",
                "人生如画，需要用心去描绘",
                "人生如书，需要用心去读",
                "人生如梦，需要用心去体验",
                "人生如戏，需要用心去演绎",
                "人生如茶，需要慢慢品味",
                "人生如歌，需要用心去唱",
                "人生如酒，需要慢慢品味",
                "人生如花，需要用心去呵护",
                "人生如画，需要用心去描绘",
                "人生如书，需要用心去读",
                "人生如梦，需要用心去体验",
                "人生如戏，需要用心去演绎",
                "人生如茶，需要慢慢品味",
                "人生如歌，需要用心去唱",
                "人生如酒，需要慢慢品味",
                "人生如花，需要用心去呵护",
                "人生如画，需要用心去描绘",
                "人生如书，需要用心去读",
                "人生如梦，需要用心去体验",
                "人生如戏，需要用心去演绎",
                "人生如茶，需要慢慢品味",
                "人生如歌，需要用心去唱",
                "人生如酒，需要慢慢品味",
                "人生如花，需要用心去呵护",
                "人生如画，需要用心去描绘",
                "人生如书，需要用心去读",
                "人生如梦，需要用心去体验",
                "人生如戏，需要用心去演绎",
                "人生如茶，需要慢慢品味",
                "人生如歌，需要用心去唱",
                "人生如酒，需要慢慢品味",
                "人生如花，需要用心去呵护",
                "人生如画，需要用心去描绘",
                "人生如书，需要用心去读",
                "人生如梦，需要用心去体验",
                "人生如戏，需要用心去演绎"
            };
        java.util.Random random = new java.util.Random();
        int personali = random.nextInt(personalizedsigna.length);
        String persona = personalizedsigna[personali];
        return persona;


    }



    public String  Randomage()
    {
        Random random = new Random();
        int age = (int) (Math.random() * 100);
        return String.valueOf(age);
    }

    public String Randomgender()

    {
        String[] gender = {"男","女","保密"};
        java.util.Random random = new java.util.Random();
        int genderi = random.nextInt(gender.length);
        String gender1 = gender[genderi];
        return gender1;
    }

    public String Randomchatheads()
        {
            String[] chatheads = {
                    "https://q7.itc.cn/q_70/images03/20240423/6d236fae5c8f44ed9b60d977f32debb7.jpeg",
                    "https://q4.itc.cn/q_70/images03/20240515/18f3c7131e344b6888f3d13c6570931a.jpeg",
                    "https://img1.baidu.com/it/u=3995643348,1848098846&fm=253&fmt=auto&app=138&f=JPEG?w=800&h=800",
                    "https://b0.bdstatic.com/866674faedf144086e041bc0a4906d67.jpg@h_1280",
                    "https://b0.bdstatic.com/619e8c602661716bb4045ca70cb290ab.jpg@h_1280",
                    "http://img0.baidu.com/it/u=2134407923,725365898&fm=253&app=138&f=JPEG?w=712&h=712",
                    "https://img0.baidu.com/it/u=3813043996,533401043&fm=253&fmt=auto&app=138&f=JPEG?w=665&h=629",
                    "https://img1.baidu.com/it/u=3688747393,553749800&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=499",
                    "https://img2.baidu.com/it/u=3619175847,3504596994&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500",
                    "https://gimg2.baidu.com/image_search/src=http%3A%2F%2Fsafe-img.xhscdn.com%2Fbw1%2Fcdc09eb7-1cfa-4196-8d37-eceb3d891b9d%3FimageView2%2F2%2Fw%2F1080%2Fformat%2Fjpg&refer=http%3A%2F%2Fsafe-img.xhscdn.com&app=2002&size=f9999,10000&q=a80&n=0&g=0n&fmt=auto?sec=1720247478&t=61dbc7c53fc2c878a812e67db08eb4d3"

        };
        java.util.Random random = new java.util.Random();
            int chatheads1 = random.nextInt(chatheads.length);
            String chatheads2 = chatheads[chatheads1];

            return chatheads2;
    }

    public String IDRandom() {
        String[] val = {
                "A","B","C","D","E","F","G",
                "H","I","J","K","L","M","N",
                "O","P","Q","R","S","T","U",
                "V","W","X","Y","Z"
        };
        java.util.Random random = new java.util.Random();
        int vali = random.nextInt(val.length);
        String valiL = val[vali];
        int num = random.nextInt(99999999);



        return valiL+num;
    }



    public static void main(String[] args) {
        RandomN random = new RandomN();
        System.out.println(random.RandompersonalizedSigna());
        System.out.println(random.RandomNickname());
        System.out.println(random.Randomgender());
        System.out.println(random.Randomchatheads());
        System.out.println(random.IDRandom());

    }






}
